In [ ]:
## Exploring and evaluating data

In [2]:
# Open the data/yeast.csv

import pandas as pd

In [4]:
df_yeast_data = pd.read_csv('../data/yeast.csv',header=None)

df_yeast_data

               0     1     2     3     4    5    6     7     8    9
0     ADT1_YEAST  0.58  0.61  0.47  0.13  0.5  0.0  0.48  0.22  MIT
1     ADT2_YEAST  0.43  0.67  0.48  0.27  0.5  0.0  0.53  0.22  MIT
2     ADT3_YEAST  0.64  0.62  0.49  0.15  0.5  0.0  0.53  0.22  MIT
3     AAR2_YEAST  0.58  0.44  0.57  0.13  0.5  0.0  0.54  0.22  NUC
4     AATM_YEAST  0.42  0.44  0.48  0.54  0.5  0.0  0.48  0.22  MIT
...          ...   ...   ...   ...   ...  ...  ...   ...   ...  ...
1479  YUR1_YEAST  0.81  0.62  0.43  0.17  0.5  0.0  0.53  0.22  ME2
1480  ZIP1_YEAST  0.47  0.43  0.61  0.40  0.5  0.0  0.48  0.47  NUC
1481  ZNRP_YEAST  0.67  0.57  0.36  0.19  0.5  0.0  0.56  0.22  ME2
1482  ZUO1_YEAST  0.43  0.40  0.60  0.16  0.5  0.0  0.53  0.39  NUC
1483  G6PD_YEAST  0.65  0.54  0.54  0.13  0.5  0.0  0.53  0.22  CYT

[1484 rows x 10 columns]

In [5]:
# Check the length of the df

len(df_yeast_data)

1484

In [7]:
#Top record

df_yeast_data.head()

df_yeast_data.describe()

,1,2,3,4,5,6,7,8
count,1484.000000,1484.000000,1484.000000,1484.000000,1484.000000,1484.000000,1484.000000,1484.000000
mean,0.500121,0.499933,0.500034,0.261186,0.504717,0.007500,0.499885,0.276199
std,0.137299,0.123924,0.086670,0.137098,0.048351,0.075683,0.057797,0.106491
min,0.110000,0.130000,0.210000,0.000000,0.500000,0.000000,0.000000,0.000000
25%,0.410000,0.420000,0.460000,0.170000,0.500000,0.000000,0.480000,0.220000
50%,0.490000,0.490000,0.510000,0.220000,0.500000,0.000000,0.510000,0.220000
75%,0.580000,0.570000,0.550000,0.320000,0.500000,0.000000,0.530000,0.300000
max,1.000000,1.000000,1.000000,1.000000,1.000000,0.830000,0.730000,1.000000

In [8]:
# Specify the records you need from the head

df_yeast_data.head(10)

            0     1     2     3     4    5    6     7     8    9
0  ADT1_YEAST  0.58  0.61  0.47  0.13  0.5  0.0  0.48  0.22  MIT
1  ADT2_YEAST  0.43  0.67  0.48  0.27  0.5  0.0  0.53  0.22  MIT
2  ADT3_YEAST  0.64  0.62  0.49  0.15  0.5  0.0  0.53  0.22  MIT
3  AAR2_YEAST  0.58  0.44  0.57  0.13  0.5  0.0  0.54  0.22  NUC
4  AATM_YEAST  0.42  0.44  0.48  0.54  0.5  0.0  0.48  0.22  MIT
5  AATC_YEAST  0.51  0.40  0.56  0.17  0.5  0.5  0.49  0.22  CYT
6  ABC1_YEAST  0.50  0.54  0.48  0.65  0.5  0.0  0.53  0.22  MIT
7  BAF1_YEAST  0.48  0.45  0.59  0.20  0.5  0.0  0.58  0.34  NUC
8  ABF2_YEAST  0.55  0.50  0.66  0.36  0.5  0.0  0.49  0.22  MIT
9  ABP1_YEAST  0.40  0.39  0.60  0.15  0.5  0.0  0.58  0.30  CYT

In [9]:
# tail record

df_yeast_data.tail()

               0     1     2     3     4    5    6     7     8    9
1479  YUR1_YEAST  0.81  0.62  0.43  0.17  0.5  0.0  0.53  0.22  ME2
1480  ZIP1_YEAST  0.47  0.43  0.61  0.40  0.5  0.0  0.48  0.47  NUC
1481  ZNRP_YEAST  0.67  0.57  0.36  0.19  0.5  0.0  0.56  0.22  ME2
1482  ZUO1_YEAST  0.43  0.40  0.60  0.16  0.5  0.0  0.53  0.39  NUC
1483  G6PD_YEAST  0.65  0.54  0.54  0.13  0.5  0.0  0.53  0.22  CYT

In [12]:
# Filter df by column name
df_yeast_data[0]

            0     1     2     3     4    5    6     7     8    9
0  ADT1_YEAST  0.58  0.61  0.47  0.13  0.5  0.0  0.48  0.22  MIT
1  ADT2_YEAST  0.43  0.67  0.48  0.27  0.5  0.0  0.53  0.22  MIT
2  ADT3_YEAST  0.64  0.62  0.49  0.15  0.5  0.0  0.53  0.22  MIT
3  AAR2_YEAST  0.58  0.44  0.57  0.13  0.5  0.0  0.54  0.22  NUC

In [13]:
# Filter three columns, enter column needed as list
df_yeast_data[[0,3,7]]

               0     3     7
0     ADT1_YEAST  0.47  0.48
1     ADT2_YEAST  0.48  0.53
2     ADT3_YEAST  0.49  0.53
3     AAR2_YEAST  0.57  0.54
4     AATM_YEAST  0.48  0.48
...          ...   ...   ...
1479  YUR1_YEAST  0.43  0.53
1480  ZIP1_YEAST  0.61  0.48
1481  ZNRP_YEAST  0.36  0.56
1482  ZUO1_YEAST  0.60  0.53
1483  G6PD_YEAST  0.54  0.53

[1484 rows x 3 columns]

In [14]:
# Using iloc to select data
# format: df_yeast_data.iloc[row_indexer, column_indexer]

df_yeast_data.iloc[0:4]

            0     1     2     3     4    5    6     7     8    9
0  ADT1_YEAST  0.58  0.61  0.47  0.13  0.5  0.0  0.48  0.22  MIT
1  ADT2_YEAST  0.43  0.67  0.48  0.27  0.5  0.0  0.53  0.22  MIT
2  ADT3_YEAST  0.64  0.62  0.49  0.15  0.5  0.0  0.53  0.22  MIT
3  AAR2_YEAST  0.58  0.44  0.57  0.13  0.5  0.0  0.54  0.22  NUC

In [15]:
# Filter by rows And columns

df_yeast_data.iloc[0:4,2:5]

      2     3     4
0  0.61  0.47  0.13
1  0.67  0.48  0.27
2  0.62  0.49  0.15
3  0.44  0.57  0.13

In [16]:
# Select row using Boolean Indexer
# Get all records whose col_9="MIT"
df_yeast_data[df_yeast_data[9]=="MIT"]

               0     1     2     3     4    5    6     7     8    9
0     ADT1_YEAST  0.58  0.61  0.47  0.13  0.5  0.0  0.48  0.22  MIT
1     ADT2_YEAST  0.43  0.67  0.48  0.27  0.5  0.0  0.53  0.22  MIT
2     ADT3_YEAST  0.64  0.62  0.49  0.15  0.5  0.0  0.53  0.22  MIT
4     AATM_YEAST  0.42  0.44  0.48  0.54  0.5  0.0  0.48  0.22  MIT
6     ABC1_YEAST  0.50  0.54  0.48  0.65  0.5  0.0  0.53  0.22  MIT
...          ...   ...   ...   ...   ...  ...  ...   ...   ...  ...
1462   ACP_YEAST  0.52  0.53  0.58  0.69  0.5  0.0  0.50  0.22  MIT
1468  YMC1_YEAST  0.39  0.58  0.47  0.18  0.5  0.0  0.48  0.22  MIT
1469  YMC2_YEAST  0.38  0.47  0.47  0.18  0.5  0.0  0.44  0.26  MIT
1470  YME1_YEAST  0.63  0.57  0.50  0.48  0.5  0.0  0.51  0.22  MIT
1471  RMR3_YEAST  0.51  0.45  0.62  0.25  0.5  0.0  0.59  0.22  MIT

[244 rows x 10 columns]

In [17]:
# Get all records where col_1 is greater then 0.5
df_yeast_data[df_yeast_data[1]>=0.5]

               0     1     2     3     4    5    6     7     8    9
0     ADT1_YEAST  0.58  0.61  0.47  0.13  0.5  0.0  0.48  0.22  MIT
2     ADT3_YEAST  0.64  0.62  0.49  0.15  0.5  0.0  0.53  0.22  MIT
3     AAR2_YEAST  0.58  0.44  0.57  0.13  0.5  0.0  0.54  0.22  NUC
5     AATC_YEAST  0.51  0.40  0.56  0.17  0.5  0.5  0.49  0.22  CYT
6     ABC1_YEAST  0.50  0.54  0.48  0.65  0.5  0.0  0.53  0.22  MIT
...          ...   ...   ...   ...   ...  ...  ...   ...   ...  ...
1475  YP53_YEAST  0.71  0.50  0.50  0.18  0.5  0.0  0.46  0.22  CYT
1476  YPT7_YEAST  0.61  0.48  0.54  0.25  0.5  0.0  0.50  0.22  CYT
1479  YUR1_YEAST  0.81  0.62  0.43  0.17  0.5  0.0  0.53  0.22  ME2
1481  ZNRP_YEAST  0.67  0.57  0.36  0.19  0.5  0.0  0.56  0.22  ME2
1483  G6PD_YEAST  0.65  0.54  0.54  0.13  0.5  0.0  0.53  0.22  CYT

[691 rows x 10 columns]

In [18]:
#Replace value
# Assign 'Waldo weber ' to col_9, for all rows that match col_9 = 'MIT'

C:\Users\marti\AppData\Local\Temp\ipykernel_37672\1025795570.py:3: FutureWarning: DataFrame.replace without 'value' and with non-dict-like 'to_replace' is deprecated and will raise in a future version. Explicitly specify the new values instead.
  df_yeast_data[df_yeast_data[9]=="MIT"].replace(to_replace="Waldo Weber")

               0     1     2     3     4    5    6     7     8    9
0     ADT1_YEAST  0.58  0.61  0.47  0.13  0.5  0.0  0.48  0.22  MIT
1     ADT2_YEAST  0.43  0.67  0.48  0.27  0.5  0.0  0.53  0.22  MIT
2     ADT3_YEAST  0.64  0.62  0.49  0.15  0.5  0.0  0.53  0.22  MIT
4     AATM_YEAST  0.42  0.44  0.48  0.54  0.5  0.0  0.48  0.22  MIT
6     ABC1_YEAST  0.50  0.54  0.48  0.65  0.5  0.0  0.53  0.22  MIT
...          ...   ...   ...   ...   ...  ...  ...   ...   ...  ...
1462   ACP_YEAST  0.52  0.53  0.58  0.69  0.5  0.0  0.50  0.22  MIT
1468  YMC1_YEAST  0.39  0.58  0.47  0.18  0.5  0.0  0.48  0.22  MIT
1469  YMC2_YEAST  0.38  0.47  0.47  0.18  0.5  0.0  0.44  0.26  MIT
1470  YME1_YEAST  0.63  0.57  0.50  0.48  0.5  0.0  0.51  0.22  MIT
1471  RMR3_YEAST  0.51  0.45  0.62  0.25  0.5  0.0  0.59  0.22  MIT

[244 rows x 10 columns]

In [20]:
#get the min(),max and std

print(f'the min of col 4 is:{df_yeast_data[4].min()}')
print(f'the max of col 4 is:{df_yeast_data[4].max()}')
print(f'the std of col 4 is:{df_yeast_data[4].std()}')

the min of col 4 is:0.0
the max of col 4 is:1.0
the std of col 4 is:0.13709763089421498

In [1]:
#Data Correlation
# columns that are redundant
# change of value in one column yield an almost constant change in another